awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f005x6.h
/********************************* Bit definition for ADC_CR register ***********************************************/
#define ADC_CR_ADEN_Pos                           (0U)
#define ADC_CR_ADEN_Msk                           (0x1UL<<ADC_CR_ADEN_Pos)                          /*!< 0x00000001 */
#define ADC_CR_ADEN                               ADC_CR_ADEN_Msk                                   
#define ADC_CR_ADDIS_Pos                          (1U)
#define ADC_CR_ADDIS_Msk                          (0x1UL<<ADC_CR_ADDIS_Pos)                         /*!< 0x00000002 */
#define ADC_CR_ADDIS                              ADC_CR_ADDIS_Msk                                  
#define ADC_CR_ADSTART_Pos                        (2U)
#define ADC_CR_ADSTART_Msk                        (0x1UL<<ADC_CR_ADSTART_Pos)                       /*!< 0x00000004 */
#define ADC_CR_ADSTART                            ADC_CR_ADSTART_Msk                                
#define ADC_CR_ADSTP_Pos                          (4U)
#define ADC_CR_ADSTP_Msk                          (0x1UL<<ADC_CR_ADSTP_Pos)                         /*!< 0x00000010 */
#define ADC_CR_ADSTP                              ADC_CR_ADSTP_Msk                                  
#define ADC_CR_RSTCAL_Pos                         (29U)
#define ADC_CR_RSTCAL_Msk                         (0x1UL<<ADC_CR_RSTCAL_Pos)                        /*!< 0x20000000 */
#define ADC_CR_RSTCAL                             ADC_CR_RSTCAL_Msk                                 
#define ADC_CR_ADCAL_START_Pos                    (30U)
#define ADC_CR_ADCAL_START_Msk                    (0x1UL<<ADC_CR_ADCAL_START_Pos)                   /*!< 0x40000000 */
#define ADC_CR_ADCAL_START                        ADC_CR_ADCAL_START_Msk                            
#define ADC_CR_ADCAL_Pos                          (31U)
#define ADC_CR_ADCAL_Msk                          (0x1UL<<ADC_CR_ADCAL_Pos)                         /*!< 0x80000000 */
#define ADC_CR_ADCAL                              ADC_CR_ADCAL_Msk                                  

/********************************* Bit definition for ADC_CFGR register *********************************************/
#define ADC_CFGR1_RESSEL_Pos                      (3U)
#define ADC_CFGR1_RESSEL_Msk                      (0x3UL<<ADC_CFGR1_RESSEL_Pos)                      /*!< 0x00000018 */
#define ADC_CFGR1_RESSEL                          ADC_CFGR1_RESSEL_Msk
#define ADC_CFGR1_RESSEL_0                        (0x1UL<<ADC_CFGR1_RESSEL_Pos)                      /*!< 0x00000008 */
#define ADC_CFGR1_RESSEL_1                        (0x2UL<<ADC_CFGR1_RESSEL_Pos)                      /*!< 0x00000010 */
#define ADC_CFGR1_ALIGN_Pos                       (5U)
#define ADC_CFGR1_ALIGN_Msk                       (0x1UL<<ADC_CFGR1_ALIGN_Pos)                       /*!< 0x00000020 */
#define ADC_CFGR1_ALIGN                           ADC_CFGR1_ALIGN_Msk                                
#define ADC_CFGR1_EXTSEL_Pos                      (6U)
#define ADC_CFGR1_EXTSEL_Msk                      (0x7UL<<ADC_CFGR1_EXTSEL_Pos)                      /*!< 0x000001C0 */
#define ADC_CFGR1_EXTSEL                          ADC_CFGR1_EXTSEL_Msk
#define ADC_CFGR1_EXTSEL_0                        (0x1UL<<ADC_CFGR1_EXTSEL_Pos)                      /*!< 0x00000040 */
#define ADC_CFGR1_EXTSEL_1                        (0x2UL<<ADC_CFGR1_EXTSEL_Pos)                      /*!< 0x00000080 */
#define ADC_CFGR1_EXTSEL_2                        (0x4UL<<ADC_CFGR1_EXTSEL_Pos)                      /*!< 0x00000100 */
#define ADC_CFGR1_EXTEN_Pos                       (10U)
#define ADC_CFGR1_EXTEN_Msk                       (0x3UL<<ADC_CFGR1_EXTEN_Pos)                       /*!< 0x00000C00 */
#define ADC_CFGR1_EXTEN                           ADC_CFGR1_EXTEN_Msk
#define ADC_CFGR1_EXTEN_0                         (0x1UL<<ADC_CFGR1_EXTEN_Pos)                       /*!< 0x00000400 */
#define ADC_CFGR1_EXTEN_1                         (0x2UL<<ADC_CFGR1_EXTEN_Pos)                       /*!< 0x00000800 */
#define ADC_CFGR1_OVRMOD_Pos                      (12U)
#define ADC_CFGR1_OVRMOD_Msk                      (0x1UL<<ADC_CFGR1_OVRMOD_Pos)                      /*!< 0x00001000 */
#define ADC_CFGR1_OVRMOD                          ADC_CFGR1_OVRMOD_Msk                               
#define ADC_CFGR1_CONT_Pos                        (13U)
#define ADC_CFGR1_CONT_Msk                        (0x1UL<<ADC_CFGR1_CONT_Pos)                        /*!< 0x00002000 */
#define ADC_CFGR1_CONT                            ADC_CFGR1_CONT_Msk                                 
#define ADC_CFGR1_WAIT_Pos                        (14U)
#define ADC_CFGR1_WAIT_Msk                        (0x1UL<<ADC_CFGR1_WAIT_Pos)                        /*!< 0x00004000 */
#define ADC_CFGR1_WAIT                            ADC_CFGR1_WAIT_Msk                                 
#define ADC_CFGR1_DISCEN_Pos                      (16U)
#define ADC_CFGR1_DISCEN_Msk                      (0x1UL<<ADC_CFGR1_DISCEN_Pos)                      /*!< 0x00010000 */
#define ADC_CFGR1_DISCEN                          ADC_CFGR1_DISCEN_Msk      
#define ADC_CFGR1_CALNUM_Pos                      (17U)
#define ADC_CFGR1_CALNUM_Msk                      (0x7UL<<ADC_CFGR1_CALNUM_Pos)                      /*!< 0x3C000000 */
#define ADC_CFGR1_CALNUM                          ADC_CFGR1_CALNUM_Msk
#define ADC_CFGR1_CALNUM_0                        (0x1UL<<ADC_CFGR1_CALNUM_Pos)                      /*!< 0x04000000 */
#define ADC_CFGR1_CALNUM_1                        (0x2UL<<ADC_CFGR1_CALNUM_Pos)                      /*!< 0x08000000 */
#define ADC_CFGR1_CALNUM_2                        (0x4UL<<ADC_CFGR1_CALNUM_Pos)                      /*!< 0x10000000 */
#define ADC_CFGR1_AWDSGL_Pos                      (22U)
#define ADC_CFGR1_AWDSGL_Msk                      (0x1UL<<ADC_CFGR1_AWDSGL_Pos)                      /*!< 0x00400000 */
#define ADC_CFGR1_AWDSGL                          ADC_CFGR1_AWDSGL_Msk                               
#define ADC_CFGR1_AWDEN_Pos                       (23U)
#define ADC_CFGR1_AWDEN_Msk                       (0x1UL<<ADC_CFGR1_AWDEN_Pos)                       /*!< 0x00800000 */
#define ADC_CFGR1_AWDEN                           ADC_CFGR1_AWDEN_Msk                                
#define ADC_CFGR1_AWDCH_Pos                       (26U)
#define ADC_CFGR1_AWDCH_Msk                       (0xFUL<<ADC_CFGR1_AWDCH_Pos)                       /*!< 0x3C000000 */
#define ADC_CFGR1_AWDCH                           ADC_CFGR1_AWDCH_Msk
#define ADC_CFGR1_AWDCH_0                         (0x1UL<<ADC_CFGR1_AWDCH_Pos)                       /*!< 0x04000000 */
#define ADC_CFGR1_AWDCH_1                         (0x2UL<<ADC_CFGR1_AWDCH_Pos)                       /*!< 0x08000000 */
#define ADC_CFGR1_AWDCH_2                         (0x4UL<<ADC_CFGR1_AWDCH_Pos)                       /*!< 0x10000000 */
#define ADC_CFGR1_AWDCH_3                         (0x8UL<<ADC_CFGR1_AWDCH_Pos)                       /*!< 0x20000000 */

/********************************* Bit definition for ADC_CFGR2 register ********************************************/
#define ADC_CFGR2_CKMODE_Pos                      (28U)
#define ADC_CFGR2_CKMODE_Msk                      (0xFUL<<ADC_CFGR2_CKMODE_Pos)                     /*!< 0xF0000000 */
#define ADC_CFGR2_CKMODE                          ADC_CFGR2_CKMODE_Msk
#define ADC_CFGR2_CKMODE_0                        (0x1UL<<ADC_CFGR2_CKMODE_Pos)                     /*!< 0x10000000 */
#define ADC_CFGR2_CKMODE_1                        (0x2UL<<ADC_CFGR2_CKMODE_Pos)                     /*!< 0x20000000 */
#define ADC_CFGR2_CKMODE_2                        (0x4UL<<ADC_CFGR2_CKMODE_Pos)                     /*!< 0x40000000 */
#define ADC_CFGR2_CKMODE_3                        (0x8UL<<ADC_CFGR2_CKMODE_Pos)                     /*!< 0x80000000 */

/********************************* Bit definition for ADC_SMPR register *********************************************/
#define ADC_SMPR_SMP_Pos                          (0U)
#define ADC_SMPR_SMP_Msk                          (0x7UL<<ADC_SMPR_SMP_Pos)                         /*!< 0x00000007 */
#define ADC_SMPR_SMP                              ADC_SMPR_SMP_Msk
#define ADC_SMPR_SMP_0                            (0x1UL<<ADC_SMPR_SMP_Pos)                         /*!< 0x00000001 */
#define ADC_SMPR_SMP_1                            (0x2UL<<ADC_SMPR_SMP_Pos)                         /*!< 0x00000002 */
#define ADC_SMPR_SMP_2                            (0x4UL<<ADC_SMPR_SMP_Pos)                         /*!< 0x00000004 */

/********************************* Bit definition for ADC_TR register ***********************************************/
#define ADC_TR_LT_Pos                             (0U)
#define ADC_TR_LT_Msk                             (0xFFFUL<<ADC_TR_LT_Pos)                          /*!< 0x00000FFF */
#define ADC_TR_LT                                 ADC_TR_LT_Msk
#define ADC_TR_HT_Pos                             (16U)
#define ADC_TR_HT_Msk                             (0xFFFUL<<ADC_TR_HT_Pos)                          /*!< 0x0FFF0000 */
#define ADC_TR_HT                                 ADC_TR_HT_Msk

/********************************* Bit definition for ADC_SQR1 register *********************************************/
#define ADC_SQR1_L_Pos                            (0U)
#define ADC_SQR1_L_Msk                            (0xFUL<<ADC_SQR1_L_Pos)                           /*!< 0x0000000F */
#define ADC_SQR1_L                                ADC_SQR1_L_Msk
#define ADC_SQR1_L_0                              (0x1UL<<ADC_SQR1_L_Pos)                           /*!< 0x00000001 */
#define ADC_SQR1_L_1                              (0x2UL<<ADC_SQR1_L_Pos)                           /*!< 0x00000002 */
#define ADC_SQR1_L_2                              (0x4UL<<ADC_SQR1_L_Pos)                           /*!< 0x00000004 */
#define ADC_SQR1_L_3                              (0x8UL<<ADC_SQR1_L_Pos)                           /*!< 0x00000008 */
#define ADC_SQR1_SQ1_Pos                          (6U)
#define ADC_SQR1_SQ1_Msk                          (0xFUL<<ADC_SQR1_SQ1_Pos)                         /*!< 0x000003C0 */
#define ADC_SQR1_SQ1                              ADC_SQR1_SQ1_Msk
#define ADC_SQR1_SQ1_0                            (0x1UL<<ADC_SQR1_SQ1_Pos)                         /*!< 0x00000040 */
#define ADC_SQR1_SQ1_1                            (0x2UL<<ADC_SQR1_SQ1_Pos)                         /*!< 0x00000080 */
#define ADC_SQR1_SQ1_2                            (0x4UL<<ADC_SQR1_SQ1_Pos)                         /*!< 0x00000100 */
#define ADC_SQR1_SQ1_3                            (0x8UL<<ADC_SQR1_SQ1_Pos)                         /*!< 0x00000200 */
#define ADC_SQR1_SQ2_Pos                          (12U)
#define ADC_SQR1_SQ2_Msk                          (0xFUL<<ADC_SQR1_SQ2_Pos)                         /*!< 0x0000F000 */
#define ADC_SQR1_SQ2                              ADC_SQR1_SQ2_Msk
#define ADC_SQR1_SQ2_0                            (0x1UL<<ADC_SQR1_SQ2_Pos)                         /*!< 0x00001000 */
#define ADC_SQR1_SQ2_1                            (0x2UL<<ADC_SQR1_SQ2_Pos)                         /*!< 0x00002000 */
#define ADC_SQR1_SQ2_2                            (0x4UL<<ADC_SQR1_SQ2_Pos)                         /*!< 0x00004000 */
#define ADC_SQR1_SQ2_3                            (0x8UL<<ADC_SQR1_SQ2_Pos)                         /*!< 0x00008000 */
#define ADC_SQR1_SQ3_Pos                          (18U)
#define ADC_SQR1_SQ3_Msk                          (0xFUL<<ADC_SQR1_SQ3_Pos)                         /*!< 0x003C0000 */
#define ADC_SQR1_SQ3                              ADC_SQR1_SQ3_Msk
#define ADC_SQR1_SQ3_0                            (0x1UL<<ADC_SQR1_SQ3_Pos)                         /*!< 0x00040000 */
#define ADC_SQR1_SQ3_1                            (0x2UL<<ADC_SQR1_SQ3_Pos)                         /*!< 0x00080000 */
#define ADC_SQR1_SQ3_2                            (0x4UL<<ADC_SQR1_SQ3_Pos)                         /*!< 0x00100000 */
#define ADC_SQR1_SQ3_3                            (0x8UL<<ADC_SQR1_SQ3_Pos)                         /*!< 0x00200000 */
#define ADC_SQR1_SQ4_Pos                          (24U)
#define ADC_SQR1_SQ4_Msk                          (0xFUL<<ADC_SQR1_SQ4_Pos)                         /*!< 0x0F000000 */
#define ADC_SQR1_SQ4                              ADC_SQR1_SQ4_Msk
#define ADC_SQR1_SQ4_0                            (0x1UL<<ADC_SQR1_SQ4_Pos)                         /*!< 0x01000000 */
#define ADC_SQR1_SQ4_1                            (0x2UL<<ADC_SQR1_SQ4_Pos)                         /*!< 0x02000000 */
#define ADC_SQR1_SQ4_2                            (0x4UL<<ADC_SQR1_SQ4_Pos)                         /*!< 0x04000000 */
#define ADC_SQR1_SQ4_3                            (0x8UL<<ADC_SQR1_SQ4_Pos)                         /*!< 0x08000000 */

/********************************* Bit definition for ADC_SQR2 register *********************************************/
#define ADC_SQR2_SQ5_Pos                          (0U)
#define ADC_SQR2_SQ5_Msk                          (0xFUL<<ADC_SQR2_SQ5_Pos)                         /*!< 0x0000000F */
#define ADC_SQR2_SQ5                              ADC_SQR2_SQ5_Msk
#define ADC_SQR2_SQ5_0                            (0x1UL<<ADC_SQR2_SQ5_Pos)                         /*!< 0x00000001 */
#define ADC_SQR2_SQ5_1                            (0x2UL<<ADC_SQR2_SQ5_Pos)                         /*!< 0x00000002 */
#define ADC_SQR2_SQ5_2                            (0x4UL<<ADC_SQR2_SQ5_Pos)                         /*!< 0x00000004 */
#define ADC_SQR2_SQ5_3                            (0x8UL<<ADC_SQR2_SQ5_Pos)                         /*!< 0x00000008 */
#define ADC_SQR2_SQ6_Pos                          (6U)
#define ADC_SQR2_SQ6_Msk                          (0xFUL<<ADC_SQR2_SQ6_Pos)                         /*!< 0x000003C0 */
#define ADC_SQR2_SQ6                              ADC_SQR2_SQ6_Msk
#define ADC_SQR2_SQ6_0                            (0x1UL<<ADC_SQR2_SQ6_Pos)                         /*!< 0x00000040 */
#define ADC_SQR2_SQ6_1                            (0x2UL<<ADC_SQR2_SQ6_Pos)                         /*!< 0x00000080 */
#define ADC_SQR2_SQ6_2                            (0x4UL<<ADC_SQR2_SQ6_Pos)                         /*!< 0x00000100 */
#define ADC_SQR2_SQ6_3                            (0x8UL<<ADC_SQR2_SQ6_Pos)                         /*!< 0x00000200 */
#define ADC_SQR2_SQ7_Pos                          (12U)
#define ADC_SQR2_SQ7_Msk                          (0xFUL<<ADC_SQR2_SQ7_Pos)                         /*!< 0x0000F000 */
#define ADC_SQR2_SQ7                              ADC_SQR2_SQ7_Msk
#define ADC_SQR2_SQ7_0                            (0x1UL<<ADC_SQR2_SQ7_Pos)                         /*!< 0x00001000 */
#define ADC_SQR2_SQ7_1                            (0x2UL<<ADC_SQR2_SQ7_Pos)                         /*!< 0x00002000 */
#define ADC_SQR2_SQ7_2                            (0x4UL<<ADC_SQR2_SQ7_Pos)                         /*!< 0x00004000 */
#define ADC_SQR2_SQ7_3                            (0x8UL<<ADC_SQR2_SQ7_Pos)                         /*!< 0x00008000 */
#define ADC_SQR2_SQ8_Pos                          (18U)
#define ADC_SQR2_SQ8_Msk                          (0xFUL<<ADC_SQR2_SQ8_Pos)                         /*!< 0x003C0000 */
#define ADC_SQR2_SQ8                              ADC_SQR2_SQ8_Msk
#define ADC_SQR2_SQ8_0                            (0x1UL<<ADC_SQR2_SQ8_Pos)                         /*!< 0x00040000 */
#define ADC_SQR2_SQ8_1                            (0x2UL<<ADC_SQR2_SQ8_Pos)                         /*!< 0x00080000 */
#define ADC_SQR2_SQ8_2                            (0x4UL<<ADC_SQR2_SQ8_Pos)                         /*!< 0x00100000 */
#define ADC_SQR2_SQ8_3                            (0x8UL<<ADC_SQR2_SQ8_Pos)                         /*!< 0x00200000 */
#define ADC_SQR2_SQ9_Pos                          (24U)
#define ADC_SQR2_SQ9_Msk                          (0xFUL<<ADC_SQR2_SQ9_Pos)                         /*!< 0x0F000000 */
#define ADC_SQR2_SQ9                              ADC_SQR2_SQ9_Msk
#define ADC_SQR2_SQ9_0                            (0x1UL<<ADC_SQR2_SQ9_Pos)                         /*!< 0x01000000 */
#define ADC_SQR2_SQ9_1                            (0x2UL<<ADC_SQR2_SQ9_Pos)                         /*!< 0x02000000 */
#define ADC_SQR2_SQ9_2                            (0x4UL<<ADC_SQR2_SQ9_Pos)                         /*!< 0x04000000 */
#define ADC_SQR2_SQ9_3                            (0x8UL<<ADC_SQR2_SQ9_Pos)                         /*!< 0x08000000 */

/********************************* Bit definition for ADC_SQR3 register *********************************************/
#define ADC_SQR3_SQ10_Pos                         (0U)
#define ADC_SQR3_SQ10_Msk                         (0xFUL<<ADC_SQR3_SQ10_Pos)                        /*!< 0x0000000F */
#define ADC_SQR3_SQ10                             ADC_SQR3_SQ10_Msk
#define ADC_SQR3_SQ10_0                           (0x1UL<<ADC_SQR3_SQ10_Pos)                        /*!< 0x00000001 */
#define ADC_SQR3_SQ10_1                           (0x2UL<<ADC_SQR3_SQ10_Pos)                        /*!< 0x00000002 */
#define ADC_SQR3_SQ10_2                           (0x4UL<<ADC_SQR3_SQ10_Pos)                        /*!< 0x00000004 */
#define ADC_SQR3_SQ10_3                           (0x8UL<<ADC_SQR3_SQ10_Pos)                        /*!< 0x00000008 */
#define ADC_SQR3_SQ11_Pos                         (6U)
#define ADC_SQR3_SQ11_Msk                         (0xFUL<<ADC_SQR3_SQ11_Pos)                        /*!< 0x000003C0 */
#define ADC_SQR3_SQ11                             ADC_SQR3_SQ11_Msk
#define ADC_SQR3_SQ11_0                           (0x1UL<<ADC_SQR3_SQ11_Pos)                        /*!< 0x00000040 */
#define ADC_SQR3_SQ11_1                           (0x2UL<<ADC_SQR3_SQ11_Pos)                        /*!< 0x00000080 */
#define ADC_SQR3_SQ11_2                           (0x4UL<<ADC_SQR3_SQ11_Pos)                        /*!< 0x00000100 */
#define ADC_SQR3_SQ11_3                           (0x8UL<<ADC_SQR3_SQ11_Pos)                        /*!< 0x00000200 */
#define ADC_SQR3_SQ12_Pos                         (12U)
#define ADC_SQR3_SQ12_Msk                         (0xFUL<<ADC_SQR3_SQ12_Pos)                        /*!< 0x0000F000 */
#define ADC_SQR3_SQ12                             ADC_SQR3_SQ12_Msk
#define ADC_SQR3_SQ12_0                           (0x1UL<<ADC_SQR3_SQ12_Pos)                        /*!< 0x00001000 */
#define ADC_SQR3_SQ12_1                           (0x2UL<<ADC_SQR3_SQ12_Pos)                        /*!< 0x00002000 */
#define ADC_SQR3_SQ12_2                           (0x4UL<<ADC_SQR3_SQ12_Pos)                        /*!< 0x00004000 */
#define ADC_SQR3_SQ12_3                           (0x8UL<<ADC_SQR3_SQ12_Pos)                        /*!< 0x00008000 */
#define ADC_SQR3_SQ13_Pos                         (18U)
#define ADC_SQR3_SQ13_Msk                         (0xFUL<<ADC_SQR3_SQ13_Pos)                        /*!< 0x003C0000 */
#define ADC_SQR3_SQ13                             ADC_SQR3_SQ13_Msk
#define ADC_SQR3_SQ13_0                           (0x1UL<<ADC_SQR3_SQ13_Pos)                        /*!< 0x00040000 */
#define ADC_SQR3_SQ13_1                           (0x2UL<<ADC_SQR3_SQ13_Pos)                        /*!< 0x00080000 */
#define ADC_SQR3_SQ13_2                           (0x4UL<<ADC_SQR3_SQ13_Pos)                        /*!< 0x00100000 */
#define ADC_SQR3_SQ13_3                           (0x8UL<<ADC_SQR3_SQ13_Pos)                        /*!< 0x00200000 */
#define ADC_SQR3_SQ14_Pos                         (24U)
#define ADC_SQR3_SQ14_Msk                         (0xFUL<<ADC_SQR3_SQ14_Pos)                        /*!< 0x0F000000 */
#define ADC_SQR3_SQ14                             ADC_SQR3_SQ14_Msk
#define ADC_SQR3_SQ14_0                           (0x1UL<<ADC_SQR3_SQ14_Pos)                        /*!< 0x01000000 */
#define ADC_SQR3_SQ14_1                           (0x2UL<<ADC_SQR3_SQ14_Pos)                        /*!< 0x02000000 */
#define ADC_SQR3_SQ14_2                           (0x4UL<<ADC_SQR3_SQ14_Pos)                        /*!< 0x04000000 */
#define ADC_SQR3_SQ14_3                           (0x8UL<<ADC_SQR3_SQ14_Pos)                        /*!< 0x08000000 */

/********************************* Bit definition for ADC_DR1 register **********************************************/
#define ADC_DR1_SQ1_DATA_Pos                      (0U)
#define ADC_DR1_SQ1_DATA_Msk                      (0xFFFFUL<<ADC_DR1_SQ1_DATA_Pos)                  /*!< 0x0000FFFF */
#define ADC_DR1_SQ1_DATA                          ADC_DR1_SQ1_DATA_Msk
#define ADC_DR1_SQ2_DATA_Pos                      (16U)
#define ADC_DR1_SQ2_DATA_Msk                      (0xFFFFUL<<ADC_DR1_SQ2_DATA_Pos)                  /*!< 0xFFFF0000 */
#define ADC_DR1_SQ2_DATA                          ADC_DR1_SQ2_DATA_Msk

