awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f005x6.h
#define GPIO_AFR_AFSEL1_Pos             (4U)
#define GPIO_AFR_AFSEL1_Msk             (0x7UL << GPIO_AFR_AFSEL1_Pos)           /*!< 0x000000F0 */
#define GPIO_AFR_AFSEL1                 GPIO_AFR_AFSEL1_Msk
#define GPIO_AFR_AFSEL1_0               (0x1UL << GPIO_AFR_AFSEL1_Pos)           /*!< 0x00000010 */
#define GPIO_AFR_AFSEL1_1               (0x2UL << GPIO_AFR_AFSEL1_Pos)           /*!< 0x00000020 */
#define GPIO_AFR_AFSEL1_2               (0x4UL << GPIO_AFR_AFSEL1_Pos)           /*!< 0x00000040 */

#define GPIO_AFR_AFSEL2_Pos             (8U)
#define GPIO_AFR_AFSEL2_Msk             (0x7UL << GPIO_AFR_AFSEL2_Pos)           /*!< 0x00000F00 */
#define GPIO_AFR_AFSEL2                 GPIO_AFR_AFSEL2_Msk
#define GPIO_AFR_AFSEL2_0               (0x1UL << GPIO_AFR_AFSEL2_Pos)           /*!< 0x00000100 */
#define GPIO_AFR_AFSEL2_1               (0x2UL << GPIO_AFR_AFSEL2_Pos)           /*!< 0x00000200 */
#define GPIO_AFR_AFSEL2_2               (0x4UL << GPIO_AFR_AFSEL2_Pos)           /*!< 0x00000400 */

#define GPIO_AFR_AFSEL3_Pos             (12U)
#define GPIO_AFR_AFSEL3_Msk             (0x7UL << GPIO_AFR_AFSEL3_Pos)           /*!< 0x0000F000 */
#define GPIO_AFR_AFSEL3                 GPIO_AFR_AFSEL3_Msk
#define GPIO_AFR_AFSEL3_0               (0x1UL << GPIO_AFR_AFSEL3_Pos)           /*!< 0x00001000 */
#define GPIO_AFR_AFSEL3_1               (0x2UL << GPIO_AFR_AFSEL3_Pos)           /*!< 0x00002000 */
#define GPIO_AFR_AFSEL3_2               (0x4UL << GPIO_AFR_AFSEL3_Pos)           /*!< 0x00004000 */

#define GPIO_AFR_AFSEL4_Pos             (16U)
#define GPIO_AFR_AFSEL4_Msk             (0x7UL << GPIO_AFR_AFSEL4_Pos)           /*!< 0x000F0000 */
#define GPIO_AFR_AFSEL4                 GPIO_AFR_AFSEL4_Msk
#define GPIO_AFR_AFSEL4_0               (0x1UL << GPIO_AFR_AFSEL4_Pos)           /*!< 0x00010000 */
#define GPIO_AFR_AFSEL4_1               (0x2UL << GPIO_AFR_AFSEL4_Pos)           /*!< 0x00020000 */
#define GPIO_AFR_AFSEL4_2               (0x4UL << GPIO_AFR_AFSEL4_Pos)           /*!< 0x00040000 */

#define GPIO_AFR_AFSEL5_Pos             (20U)
#define GPIO_AFR_AFSEL5_Msk             (0x7UL << GPIO_AFR_AFSEL5_Pos)           /*!< 0x00F00000 */
#define GPIO_AFR_AFSEL5                 GPIO_AFR_AFSEL5_Msk
#define GPIO_AFR_AFSEL5_0               (0x1UL << GPIO_AFR_AFSEL5_Pos)           /*!< 0x00100000 */
#define GPIO_AFR_AFSEL5_1               (0x2UL << GPIO_AFR_AFSEL5_Pos)           /*!< 0x00200000 */
#define GPIO_AFR_AFSEL5_2               (0x4UL << GPIO_AFR_AFSEL5_Pos)           /*!< 0x00400000 */

#define GPIO_AFR_AFSEL6_Pos             (24U)
#define GPIO_AFR_AFSEL6_Msk             (0x7UL << GPIO_AFR_AFSEL6_Pos)           /*!< 0x0F000000 */
#define GPIO_AFR_AFSEL6                 GPIO_AFR_AFSEL6_Msk
#define GPIO_AFR_AFSEL6_0               (0x1UL << GPIO_AFR_AFSEL6_Pos)           /*!< 0x01000000 */
#define GPIO_AFR_AFSEL6_1               (0x2UL << GPIO_AFR_AFSEL6_Pos)           /*!< 0x02000000 */
#define GPIO_AFR_AFSEL6_2               (0x4UL << GPIO_AFR_AFSEL6_Pos)           /*!< 0x04000000 */

#define GPIO_AFR_AFSEL7_Pos             (28U)
#define GPIO_AFR_AFSEL7_Msk             (0xFUL << GPIO_AFR_AFSEL7_Pos)           /*!< 0xF0000000 */
#define GPIO_AFR_AFSEL7                 GPIO_AFR_AFSEL7_Msk
#define GPIO_AFR_AFSEL7_0               (0x1UL << GPIO_AFR_AFSEL7_Pos)           /*!< 0x10000000 */
#define GPIO_AFR_AFSEL7_1               (0x2UL << GPIO_AFR_AFSEL7_Pos)           /*!< 0x20000000 */
#define GPIO_AFR_AFSEL7_2               (0x4UL << GPIO_AFR_AFSEL7_Pos)           /*!< 0x40000000 */

/******************  Bits definition for GPIO_BRR register  ******************/
#define GPIO_BRR_BR0_Pos                (0U)
#define GPIO_BRR_BR0_Msk                (0x1UL << GPIO_BRR_BR0_Pos)              /*!< 0x00000001 */
#define GPIO_BRR_BR0                    GPIO_BRR_BR0_Msk
#define GPIO_BRR_BR1_Pos                (1U)
#define GPIO_BRR_BR1_Msk                (0x1UL << GPIO_BRR_BR1_Pos)              /*!< 0x00000002 */
#define GPIO_BRR_BR1                    GPIO_BRR_BR1_Msk
#define GPIO_BRR_BR2_Pos                (2U)
#define GPIO_BRR_BR2_Msk                (0x1UL << GPIO_BRR_BR2_Pos)              /*!< 0x00000004 */
#define GPIO_BRR_BR2                    GPIO_BRR_BR2_Msk
#define GPIO_BRR_BR3_Pos                (3U)
#define GPIO_BRR_BR3_Msk                (0x1UL << GPIO_BRR_BR3_Pos)              /*!< 0x00000008 */
#define GPIO_BRR_BR3                    GPIO_BRR_BR3_Msk
#define GPIO_BRR_BR4_Pos                (4U)
#define GPIO_BRR_BR4_Msk                (0x1UL << GPIO_BRR_BR4_Pos)              /*!< 0x00000010 */
#define GPIO_BRR_BR4                    GPIO_BRR_BR4_Msk
#define GPIO_BRR_BR5_Pos                (5U)
#define GPIO_BRR_BR5_Msk                (0x1UL << GPIO_BRR_BR5_Pos)              /*!< 0x00000020 */
#define GPIO_BRR_BR5                    GPIO_BRR_BR5_Msk
#define GPIO_BRR_BR6_Pos                (6U)
#define GPIO_BRR_BR6_Msk                (0x1UL << GPIO_BRR_BR6_Pos)              /*!< 0x00000040 */
#define GPIO_BRR_BR6                    GPIO_BRR_BR6_Msk
#define GPIO_BRR_BR7_Pos                (7U)
#define GPIO_BRR_BR7_Msk                (0x1UL << GPIO_BRR_BR7_Pos)              /*!< 0x00000080 */
#define GPIO_BRR_BR7                    GPIO_BRR_BR7_Msk

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface (I2C)              */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CR1 register  ********************/
#define I2C_CR1_PE_Pos                  (0U)
#define I2C_CR1_PE_Msk                  (0x1UL << I2C_CR1_PE_Pos)          /*!< 0x00000001 */
#define I2C_CR1_PE                      I2C_CR1_PE_Msk                     /*!< Peripheral Enable */
#define I2C_CR1_ENGC_Pos                (6U)
#define I2C_CR1_ENGC_Msk                (0x1UL << I2C_CR1_ENGC_Pos)        /*!< 0x00000040 */
#define I2C_CR1_ENGC                    I2C_CR1_ENGC_Msk                   /*!< General Call Enable */
#define I2C_CR1_NOSTRETCH_Pos           (7U)
#define I2C_CR1_NOSTRETCH_Msk           (0x1UL << I2C_CR1_NOSTRETCH_Pos)   /*!< 0x00000080 */
#define I2C_CR1_NOSTRETCH               I2C_CR1_NOSTRETCH_Msk              /*!< Clock Stretching Disable (Slave mode) */
#define I2C_CR1_START_Pos               (8U)
#define I2C_CR1_START_Msk               (0x1UL << I2C_CR1_START_Pos)       /*!< 0x00000100 */
#define I2C_CR1_START                   I2C_CR1_START_Msk                  /*!< Start Generation */
#define I2C_CR1_STOP_Pos                (9U)
#define I2C_CR1_STOP_Msk                (0x1UL << I2C_CR1_STOP_Pos)        /*!< 0x00000200 */
#define I2C_CR1_STOP                    I2C_CR1_STOP_Msk                   /*!< Stop Generation */
#define I2C_CR1_ACK_Pos                 (10U)
#define I2C_CR1_ACK_Msk                 (0x1UL << I2C_CR1_ACK_Pos)         /*!< 0x00000400 */
#define I2C_CR1_ACK                     I2C_CR1_ACK_Msk                    /*!< Acknowledge Enable */
#define I2C_CR1_POS_Pos                 (11U)
#define I2C_CR1_POS_Msk                 (0x1UL << I2C_CR1_POS_Pos)         /*!< 0x00000800 */
#define I2C_CR1_POS                     I2C_CR1_POS_Msk                    /*!< Acknowledge/PEC Position (for data reception) */
#define I2C_CR1_SWRST_Pos               (15U)
#define I2C_CR1_SWRST_Msk               (0x1UL << I2C_CR1_SWRST_Pos)       /*!< 0x00008000 */
#define I2C_CR1_SWRST                   I2C_CR1_SWRST_Msk                  /*!< Software Reset */

/*******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_FREQ_Pos                (0U)
#define I2C_CR2_FREQ_Msk                (0x3FUL << I2C_CR2_FREQ_Pos)       /*!< 0x0000003F */
#define I2C_CR2_FREQ                    I2C_CR2_FREQ_Msk                   /*!< FREQ[5:0] bits (Peripheral Clock Frequency) */
#define I2C_CR2_FREQ_0                  (0x01UL << I2C_CR2_FREQ_Pos)       /*!< 0x00000001 */
#define I2C_CR2_FREQ_1                  (0x02UL << I2C_CR2_FREQ_Pos)       /*!< 0x00000002 */
#define I2C_CR2_FREQ_2                  (0x04UL << I2C_CR2_FREQ_Pos)       /*!< 0x00000004 */
#define I2C_CR2_FREQ_3                  (0x08UL << I2C_CR2_FREQ_Pos)       /*!< 0x00000008 */
#define I2C_CR2_FREQ_4                  (0x10UL << I2C_CR2_FREQ_Pos)       /*!< 0x00000010 */
#define I2C_CR2_FREQ_5                  (0x20UL << I2C_CR2_FREQ_Pos)       /*!< 0x00000020 */
#define I2C_CR2_ITERREN_Pos             (8U)
#define I2C_CR2_ITERREN_Msk             (0x1UL << I2C_CR2_ITERREN_Pos)     /*!< 0x00000100 */
#define I2C_CR2_ITERREN                 I2C_CR2_ITERREN_Msk                /*!< Error Interrupt Enable */
#define I2C_CR2_ITEVTEN_Pos             (9U)
#define I2C_CR2_ITEVTEN_Msk             (0x1UL << I2C_CR2_ITEVTEN_Pos)     /*!< 0x00000200 */
#define I2C_CR2_ITEVTEN                 I2C_CR2_ITEVTEN_Msk                /*!< Event Interrupt Enable */
#define I2C_CR2_ITBUFEN_Pos             (10U)
#define I2C_CR2_ITBUFEN_Msk             (0x1UL << I2C_CR2_ITBUFEN_Pos)     /*!< 0x00000400 */
#define I2C_CR2_ITBUFEN                 I2C_CR2_ITBUFEN_Msk                /*!< Buffer Interrupt Enable */

/*******************  Bit definition for I2C_OAR1 register  *******************/
#define I2C_OAR1_ADD1_7                 0x000000FEU                        /*!< Interface Address */
#define I2C_OAR1_ADD1_Pos               (1U)
#define I2C_OAR1_ADD1_Msk               (0x1UL << I2C_OAR1_ADD1_Pos)       /*!< 0x00000002 */
#define I2C_OAR1_ADD1                   I2C_OAR1_ADD1_Msk                  /*!< Bit 1 */
#define I2C_OAR1_ADD2_Pos               (2U)
#define I2C_OAR1_ADD2_Msk               (0x1UL << I2C_OAR1_ADD2_Pos)       /*!< 0x00000004 */
#define I2C_OAR1_ADD2                   I2C_OAR1_ADD2_Msk                  /*!< Bit 2 */
#define I2C_OAR1_ADD3_Pos               (3U)
#define I2C_OAR1_ADD3_Msk               (0x1UL << I2C_OAR1_ADD3_Pos)       /*!< 0x00000008 */
#define I2C_OAR1_ADD3                   I2C_OAR1_ADD3_Msk                  /*!< Bit 3 */
#define I2C_OAR1_ADD4_Pos               (4U)
#define I2C_OAR1_ADD4_Msk               (0x1UL << I2C_OAR1_ADD4_Pos)       /*!< 0x00000010 */
#define I2C_OAR1_ADD4                   I2C_OAR1_ADD4_Msk                  /*!< Bit 4 */
#define I2C_OAR1_ADD5_Pos               (5U)
#define I2C_OAR1_ADD5_Msk               (0x1UL << I2C_OAR1_ADD5_Pos)       /*!< 0x00000020 */
#define I2C_OAR1_ADD5                   I2C_OAR1_ADD5_Msk                  /*!< Bit 5 */
#define I2C_OAR1_ADD6_Pos               (6U)
#define I2C_OAR1_ADD6_Msk               (0x1UL << I2C_OAR1_ADD6_Pos)       /*!< 0x00000040 */
#define I2C_OAR1_ADD6                   I2C_OAR1_ADD6_Msk                  /*!< Bit 6 */
#define I2C_OAR1_ADD7_Pos               (7U)
#define I2C_OAR1_ADD7_Msk               (0x1UL << I2C_OAR1_ADD7_Pos)       /*!< 0x00000080 */
#define I2C_OAR1_ADD7                   I2C_OAR1_ADD7_Msk                  /*!< Bit 7 */

