awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f005x6.h
#define RCC_CFGR_SW_HSISYS              (0UL)                                  /*!< HSISYS used as system clock */
#define RCC_CFGR_SW_HSE                 (0x00000001UL)                         /*!< HSE used as system clock */
#define RCC_CFGR_SW_LSI                 (0x00000003UL)                         /*!< LSI used as system clock */
#define RCC_CFGR_SW_LSE                 (0x00000004UL)                         /*!< LSE used as system clock */

/*!< SWS configuration */
#define RCC_CFGR_SWS_Pos                (3U)
#define RCC_CFGR_SWS_Msk                (0x7UL << RCC_CFGR_SWS_Pos)            /*!< 0x00000038 */
#define RCC_CFGR_SWS                    RCC_CFGR_SWS_Msk                       /*!< SWS[2:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_0                  (0x1UL << RCC_CFGR_SWS_Pos)            /*!< 0x00000008 */
#define RCC_CFGR_SWS_1                  (0x2UL << RCC_CFGR_SWS_Pos)            /*!< 0x00000010 */
#define RCC_CFGR_SWS_2                  (0x4UL << RCC_CFGR_SWS_Pos)            /*!< 0x00000020 */

#define RCC_CFGR_SWS_HSISYS             (0UL)                                  /*!< HSISYS used as system clock */
#define RCC_CFGR_SWS_HSE                (0x00000008UL)                         /*!< HSE used as system clock */
#define RCC_CFGR_SWS_LSI                (0x00000018UL)                         /*!< LSI used as system clock */
#define RCC_CFGR_SWS_LSE                (0x00000020UL)                         /*!< LSE used as system clock */

/*!< HPRE configuration */
#define RCC_CFGR_HPRE_Pos               (8U)
#define RCC_CFGR_HPRE_Msk               (0xFUL << RCC_CFGR_HPRE_Pos)           /*!< 0x00000F00 */
#define RCC_CFGR_HPRE                   RCC_CFGR_HPRE_Msk                      /*!< HPRE[3:0] bits (AHB prescaler) */
#define RCC_CFGR_HPRE_0                 (0x1UL << RCC_CFGR_HPRE_Pos)           /*!< 0x00000100 */
#define RCC_CFGR_HPRE_1                 (0x2UL << RCC_CFGR_HPRE_Pos)           /*!< 0x00000200 */
#define RCC_CFGR_HPRE_2                 (0x4UL << RCC_CFGR_HPRE_Pos)           /*!< 0x00000400 */
#define RCC_CFGR_HPRE_3                 (0x8UL << RCC_CFGR_HPRE_Pos)           /*!< 0x00000800 */

/*!< PPRE configuration */
#define RCC_CFGR_PPRE_Pos               (12U)
#define RCC_CFGR_PPRE_Msk               (0x7UL << RCC_CFGR_PPRE_Pos)           /*!< 0x00007000 */
#define RCC_CFGR_PPRE                   RCC_CFGR_PPRE_Msk                      /*!< PRE1[2:0] bits (APB prescaler) */
#define RCC_CFGR_PPRE_0                 (0x1UL << RCC_CFGR_PPRE_Pos)           /*!< 0x00001000 */
#define RCC_CFGR_PPRE_1                 (0x2UL << RCC_CFGR_PPRE_Pos)           /*!< 0x00002000 */
#define RCC_CFGR_PPRE_2                 (0x4UL << RCC_CFGR_PPRE_Pos)           /*!< 0x00004000 */

/*!< MCOSEL configuration */
#define RCC_CFGR_MCOSEL_Pos             (24U)
#define RCC_CFGR_MCOSEL_Msk             (0x7UL << RCC_CFGR_MCOSEL_Pos)         /*!< 0x0F000000 */
#define RCC_CFGR_MCOSEL                 RCC_CFGR_MCOSEL_Msk                    /*!< MCOSEL [2:0] bits (Clock output selection) */
#define RCC_CFGR_MCOSEL_0               (0x1UL << RCC_CFGR_MCOSEL_Pos)         /*!< 0x01000000 */
#define RCC_CFGR_MCOSEL_1               (0x2UL << RCC_CFGR_MCOSEL_Pos)         /*!< 0x02000000 */
#define RCC_CFGR_MCOSEL_2               (0x4UL << RCC_CFGR_MCOSEL_Pos)         /*!< 0x04000000 */

/*!< MCO Prescaler configuration */
#define RCC_CFGR_MCOPRE_Pos             (28U)
#define RCC_CFGR_MCOPRE_Msk             (0x7UL << RCC_CFGR_MCOPRE_Pos)         /*!< 0x70000000 */
#define RCC_CFGR_MCOPRE                 RCC_CFGR_MCOPRE_Msk                    /*!< MCO prescaler [2:0] */
#define RCC_CFGR_MCOPRE_0               (0x1UL << RCC_CFGR_MCOPRE_Pos)         /*!< 0x10000000 */
#define RCC_CFGR_MCOPRE_1               (0x2UL << RCC_CFGR_MCOPRE_Pos)         /*!< 0x20000000 */
#define RCC_CFGR_MCOPRE_2               (0x4UL << RCC_CFGR_MCOPRE_Pos)         /*!< 0x40000000 */

/********************  Bit definition for RCC_ECSCR register  ***************/
/*!< LSE FREQ configuration */
#define RCC_ECSCR_HSE_DRV_Pos           (0U)
#define RCC_ECSCR_HSE_DRV_Msk           (0x1UL << RCC_ECSCR_HSE_DRV_Pos)       /*!< 0x00000001 */
#define RCC_ECSCR_HSE_DRV               RCC_ECSCR_HSE_DRV_Msk                
#define RCC_ECSCR_HSE_RDYSEL_Pos        (2U)                                 
#define RCC_ECSCR_HSE_RDYSEL_Msk        (0x3UL << RCC_ECSCR_HSE_RDYSEL_Pos)    /*!< 0x0000000C */
#define RCC_ECSCR_HSE_RDYSEL            RCC_ECSCR_HSE_RDYSEL_Msk             
#define RCC_ECSCR_HSE_RDYSEL_0          (0x1UL << RCC_ECSCR_HSE_RDYSEL_Pos)    /*!< 0x00000004 */
#define RCC_ECSCR_HSE_RDYSEL_1          (0x2UL << RCC_ECSCR_HSE_RDYSEL_Pos)    /*!< 0x00000008 */
#define RCC_ECSCR_HSE_FILT_ENB_Pos      (4U)                                 
#define RCC_ECSCR_HSE_FILT_ENB_Msk      (0x1UL << RCC_ECSCR_HSE_FILT_ENB_Pos)  /*!< 0x00000010 */
#define RCC_ECSCR_HSE_FILT_ENB          RCC_ECSCR_HSE_FILT_ENB_Msk        
#define RCC_ECSCR_LSE_DRIVER_Pos        (16U)
#define RCC_ECSCR_LSE_DRIVER_Msk        (3UL << RCC_ECSCR_LSE_DRIVER_Pos)      /*!< 0x00030000 */
#define RCC_ECSCR_LSE_DRIVER            RCC_ECSCR_LSE_DRIVER_Msk
#define RCC_ECSCR_LSE_DRIVER_0          (0x1UL << RCC_ECSCR_LSE_DRIVER_Pos)    /*!< 0x00010000 */
#define RCC_ECSCR_LSE_DRIVER_1          (0x2UL << RCC_ECSCR_LSE_DRIVER_Pos)    /*!< 0x00020000 */
#define RCC_ECSCR_LSE_STARTUP_Pos       (20U)
#define RCC_ECSCR_LSE_STARTUP_Msk       (3UL << RCC_ECSCR_LSE_STARTUP_Pos)     /*!< 0x00300000 */
#define RCC_ECSCR_LSE_STARTUP           RCC_ECSCR_LSE_STARTUP_Msk
#define RCC_ECSCR_LSE_STARTUP_0         (0x1UL << RCC_ECSCR_LSE_STARTUP_Pos)   /*!< 0x00100000 */
#define RCC_ECSCR_LSE_STARTUP_1         (0x2UL << RCC_ECSCR_LSE_STARTUP_Pos)   /*!< 0x00200000 */

/********************  Bit definition for RCC_CIER register  ******************/
#define RCC_CIER_LSIRDYIE_Pos           (0U)
#define RCC_CIER_LSIRDYIE_Msk           (0x1UL << RCC_CIER_LSIRDYIE_Pos)       /*!< 0x00000001 */
#define RCC_CIER_LSIRDYIE               RCC_CIER_LSIRDYIE_Msk
#define RCC_CIER_LSERDYIE_Pos           (1U)
#define RCC_CIER_LSERDYIE_Msk           (0x1UL << RCC_CIER_LSERDYIE_Pos)       /*!< 0x00000002 */
#define RCC_CIER_LSERDYIE               RCC_CIER_LSERDYIE_Msk
#define RCC_CIER_HSIRDYIE_Pos           (3U)
#define RCC_CIER_HSIRDYIE_Msk           (0x1UL << RCC_CIER_HSIRDYIE_Pos)       /*!< 0x00000008 */
#define RCC_CIER_HSIRDYIE               RCC_CIER_HSIRDYIE_Msk
#define RCC_CIER_HSERDYIE_Pos           (4U)
#define RCC_CIER_HSERDYIE_Msk           (0x1UL << RCC_CIER_HSERDYIE_Pos)       /*!< 0x00000010 */
#define RCC_CIER_HSERDYIE               RCC_CIER_HSERDYIE_Msk

/********************  Bit definition for RCC_CIFR register  ******************/
#define RCC_CIFR_LSIRDYF_Pos            (0U)
#define RCC_CIFR_LSIRDYF_Msk            (0x1UL << RCC_CIFR_LSIRDYF_Pos)        /*!< 0x00000001 */
#define RCC_CIFR_LSIRDYF                RCC_CIFR_LSIRDYF_Msk
#define RCC_CIFR_LSERDYF_Pos            (1U)
#define RCC_CIFR_LSERDYF_Msk            (0x1UL << RCC_CIFR_LSERDYF_Pos)        /*!< 0x00000002 */
#define RCC_CIFR_LSERDYF                RCC_CIFR_LSERDYF_Msk
#define RCC_CIFR_HSIRDYF_Pos            (3U)
#define RCC_CIFR_HSIRDYF_Msk            (0x1UL << RCC_CIFR_HSIRDYF_Pos)        /*!< 0x00000008 */
#define RCC_CIFR_HSIRDYF                RCC_CIFR_HSIRDYF_Msk
#define RCC_CIFR_HSERDYF_Pos            (4U)
#define RCC_CIFR_HSERDYF_Msk            (0x1UL<<RCC_CIFR_HSERDYF_Pos)          /*!< 0x00000010 */
#define RCC_CIFR_HSERDYF                RCC_CIFR_HSERDYF_Msk
#define RCC_CIFR_CSSF_Pos               (8U)
#define RCC_CIFR_CSSF_Msk               (0x1UL<<RCC_CIFR_CSSF_Pos)             /*!< 0x00000100 */
#define RCC_CIFR_CSSF                   RCC_CIFR_CSSF_Msk
#define RCC_CIFR_LSECSSF_Pos            (9U)
#define RCC_CIFR_LSECSSF_Msk            (0x1UL << RCC_CIFR_LSECSSF_Pos)        /*!< 0x00000200 */
#define RCC_CIFR_LSECSSF                RCC_CIFR_LSECSSF_Msk

/********************  Bit definition for RCC_CICR register  ******************/
#define RCC_CICR_LSIRDYC_Pos            (0U)
#define RCC_CICR_LSIRDYC_Msk            (0x1UL << RCC_CICR_LSIRDYC_Pos)        /*!< 0x00000001 */
#define RCC_CICR_LSIRDYC                RCC_CICR_LSIRDYC_Msk
#define RCC_CICR_LSERDYC_Pos            (1U)
#define RCC_CICR_LSERDYC_Msk            (0x1UL << RCC_CICR_LSERDYC_Pos)        /*!< 0x00000002 */
#define RCC_CICR_LSERDYC                RCC_CICR_LSERDYC_Msk
#define RCC_CICR_HSIRDYC_Pos            (3U)
#define RCC_CICR_HSIRDYC_Msk            (0x1UL << RCC_CICR_HSIRDYC_Pos)        /*!< 0x00000008 */
#define RCC_CICR_HSIRDYC                RCC_CICR_HSIRDYC_Msk
#define RCC_CICR_HSERDYC_Pos            (4U)
#define RCC_CICR_HSERDYC_Msk            (0x1UL<<RCC_CICR_HSERDYC_Pos)          /*!< 0x00000010 */
#define RCC_CICR_HSERDYC                RCC_CICR_HSERDYC_Msk
#define RCC_CICR_CSSC_Pos               (8U)
#define RCC_CICR_CSSC_Msk               (0x1UL<<RCC_CICR_CSSC_Pos)             /*!< 0x00000100 */
#define RCC_CICR_CSSC                   RCC_CICR_CSSC_Msk
#define RCC_CICR_LSECSSC_Pos            (9U)
#define RCC_CICR_LSECSSC_Msk            (0x1UL << RCC_CICR_LSECSSC_Pos)        /*!< 0x00000200 */
#define RCC_CICR_LSECSSC                RCC_CICR_LSECSSC_Msk

